# Pandas Datastructure : Series, dataframe 


## 1.Series

Series is a one-dimensional labeled array capable of holding any data types(int, strings, float, object)

- Can be created from dict, list, scalar (e.g.: 5)
- Can be access from key in dict formalized Seriese, can be assess by slicing the list formalized Series
- Can perform Verctorized operation
- Can assign name


### Create Series

s=pd.Series(data1, index=index)

Data can be Python Dict, ndarray or scala

In [1]:
import numpy as np
import pandas as pd

In [2]:
s=pd.Series(np.random.randn(5), index=['a','b','c','d','e'])
s

a    0.555654
b   -1.579690
c   -1.782466
d   -0.208116
e    1.565561
dtype: float64

In [3]:
# Can use slice to get the data
s[1:3]

b   -1.579690
c   -1.782466
dtype: float64

In [4]:
pd.Series(np.random.randn(5))

0   -0.345570
1   -0.348887
2   -0.100531
3   -0.209698
4    0.844457
dtype: float64

In [5]:
## Create from dictionary
d={'a':0,'b':1,'c':2}
s=pd.Series(d)
s

a    0
b    1
c    2
dtype: int64

In [6]:
## Use the key in dict to call the Series
s['a']

0

In [7]:
## From scalar value
pd.Series(5,index=['a','b','c'])

a    5
b    5
c    5
dtype: int64

### Assign name to Series

In [8]:
s=pd.Series(np.random.randn(5),name='random')
s.name

'random'

In [9]:
s=s.rename('cat')
s.name

'cat'

### Series operation

In [10]:
s1=pd.Series(np.random.randn(4))
s1

0    1.230520
1    0.447394
2   -0.285092
3   -0.217955
dtype: float64

In [11]:
s2=pd.Series(np.random.randn(1))
s2

0    0.470906
dtype: float64

In [12]:
# It can only apply one to one.
s1+s2

0    1.701426
1         NaN
2         NaN
3         NaN
dtype: float64

In [13]:
np.exp(s1)

0    3.423008
1    1.564231
2    0.751945
3    0.804162
dtype: float64

## 2.DataFrame

In [51]:
# From array:

data=np.array([['','col1','col2'],['row1',1,2],['row2',3,4]])
data

array([['', 'col1', 'col2'],
       ['row1', '1', '2'],
       ['row2', '3', '4']], dtype='<U4')

In [15]:
pd.DataFrame(data)

      0     1     2
0        col1  col2
1  row1     1     2
2  row2     3     4

In [52]:
data=pd.DataFrame(data[1:,1:], index=data[1:,0], columns=data[0,1:])
data

     col1 col2
row1    1    2
row2    3    4

#### Create empty dataframe

In [17]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [18]:
pd.DataFrame(columns=['x','y','z'])

Empty DataFrame
Columns: [x, y, z]
Index: []

### Change type of column

*** astype***

DataFrame.astype(self, dtype, copy=True, errors='raise')

In [19]:
data['col1'].dtypes

dtype('O')

In [20]:
data['col1'].apply(int)

row1    1
row2    3
Name: col1, dtype: int64

In [21]:
# Only column can be change type
data.astype({'col1':'int'}).dtypes

col1     int64
col2    object
dtype: object

In [22]:
data.astype({'col1':'category'}).dtypes

col1    category
col2      object
dtype: object

## Drop Column and add column

In [27]:
data.drop(['col2'],axis=1)

     col1
row1    1
row2    3

In [33]:
pd.concat([data,data],axis=1)

     col1 col2 col1 col2
row1    1    2    1    2
row2    3    4    3    4

## Apply fuction

In [34]:
def times3(x):
    return x**3

In [54]:
data=data.astype({'col1':int})

In [55]:
data['col3']=data['col1'].apply(times3)
data

      col1 col2  col3
row1     1    2     1
row2     3    4    27

In [58]:
data['col4']=data['col1'].apply(lambda x: x+1)
data

      col1 col2  col3  col4
row1     1    2     1     2
row2     3    4    27     4